// this
// Ключевое слово this ссылается на контекст выполняемой функции.

// function
// Ключевое слово function определяет выражение функции.

// class
// Ключевое слово class определяет выражение класса.

// function*
// Ключевое слово function* (со звёздочкой) определяет функцию-генератор.

// yield
// Пауза или продолжение выполнения функции-генератора.

// yield*
// Делегирует выполнение другому генератору итерируемому объекту.

// Экспериментальная возможность async function*
// async function определяет выражение асинхронной функции.

// Экспериментальная возможность await
// Пауза и продолжение выполнения асинхронной функции и ожидание Promise (результата выполнения) с результатом разрешено/отклонено.

// []
// Синтаксис создания инициализатора/литерала массива.

// {}
// Синтаксис создания инициализатора/литерала объекта

// /ab+c/i
// Синтаксис создания литерала регулярного выражения.

// ( )
// Оператор группировки.