// Операторы присваивания x = y
// Операторы присваивания x += y | x = x + y

// Операторы сравнения == равно
// Операторы сравнения != не равно
// Операторы сравнения === строго равно
// Операторы сравнения !== строго не равно
// Операторы сравнения >= больше или равно
// Операторы сравнения > больше

// Арифметические операторы
// Инкремент ++x это префиксный
let x=3;
console.log(++x);
console.log(x);
// Декремент y-- это постфиксный
let y=3;
console.log(y--);
console.log(y);
// TODO написать пример цикла for i++



// Битовые (поразрядные) операторы (редкие)

// Логические операторы
// && || !
// TODO попрактиковаться на if 

// Строковые операторы
console.log("my " + "string");
// Условный (тернарный) оператор
// единственным оператором JavaScript, который использует три операнда. Оператор принимает одно из двух значений в зависимости от заданного условия. Синтаксис оператора:
// condition ? val1 : val2 тот же самый if но меньше скобок
// TODO изучить сначала if

// Оператор запятая
// Унарные операторы
// delete
// typeof
// in
// TODO разобрать in вместе с объектами propNameOrNumber in objectName
// toinstanceof
// TODO разобрать toinstanceof вместе с объектами objectName instanceof objectType
// ~ - +
 let resault="b" + "a" + + "a" + "a"
 console.log(resault.toLowerCase());
 console.log(resault);
 console.log("CaMeL".toUpperCase());
 
 
// Операторы отношения
// Приоритет операторов